Repository: z244370114/woodenfish
Catalog: lib/l10n/intl_*.arb
Languages: ja, ko, th, zh

# appName
source: Wooden Fish - Chanting Artifact
ja: 木製の魚 - 詠唱アーティファクト
ko: 나무 물고기 - 영창 유물
th: ปลาไม้ - สิ่งประดิษฐ์สวดมนต์
zh: 木鱼 - 念经神器

source: Hello!
ja: やあやあ！
ko: 안녕 안녕!
th: สวัสดี!
zh: 施主，你好！

source: Home
ja: ホーム
ko: 집
th: บ้าน
zh: 首页

# prayerBeads
source: Buddhist
ja: 数珠
ko: 불교구슬
th: ลูกปัดพุทธ
zh: 佛珠

# me
source: My
ja: 「私」
ko: 나
th: ของฉัน
zh: 我的

source: Setting
ja: 設定
ko: 설정
th: การตั้งค่า
zh: 设置

# shareTxt
source: share
ja: 祝福を分かち合う
ko: 축복을 나누다
th: แบ่งปันคำอวยพร
zh: 分享福愿

source: Privacy Policy
ja: プライバシー ポリシー
ko: 개인정보 보호정책
th: นโยบายความเป็นส่วนตัว
zh: 隐私政策

source: User Agreement
ja: ユーザー同意書
ko: 사용자 계약
th: ข้อตกลงผู้ใช้
zh: 用户协议

source: Terms Use
ja: 利用規約
ko: 사용 약관
th: เงื่อนไขการใช้งาน
zh: 使用条款

source: About Us
ja: 私たちについて
ko: 회사 소개
th: เกี่ยวกับเรา
zh: 关于我们

# wfIntroduction
source: Introduction to Wooden Fish
ja: 木魚の紹介
ko: 나무 물고기 소개
th: ความรู้เบื้องต้นเกี่ยวกับปลาไม้
zh: 木鱼简介

# fu
source: Symbol
ja: 記号
ko: 상징
th: สัญลักษณ์
zh: 符

# bg
source: Background
ja: バックグラウンド
ko: 배경
th: พื้นหลัง
zh: 背景

# bgm
source: Background Music
ja: バックグラウンドミュージック
ko: 배경 음악
th: เพลงประกอบ
zh: 背景音乐

source: Automatic Tapping
ja: 自動タッピング
ko: 자동 탭핑
th: การแตะอัตโนมัติ
zh: 自动敲击

# snowflakeText
source: Snowflake background
ja: 雪の結晶の背景
ko: 눈송이 배경
th: พื้นหลังเกล็ดหิมะ
zh: 雪花背景

source: Suspended Text
ja: 一時停止されたテキスト
ko: 중단된 텍스트
th: ข้อความที่ถูกระงับ
zh: 悬浮文字

# suspendedTextTip
source: Please enter the suspended text: such as: merit, good luck, making money
ja: 保留中のテキストを入力してください: メリット、幸運、金儲けなど
ko: 중단된 텍스트를 입력하세요: 장점, 행운, 돈 벌기
th: โปรดป้อนข้อความระงับ: เช่น: บุญ, โชคดี, ทำเงิน
zh: 请输入悬浮文字：列如：功德、好运、搞钱

# suspendedNoTip
source: Sorry! This suspended tip is not available!
ja: 申し訳ありません! この保留中のチップは利用できません!
ko: 죄송합니다! 이 정지된 팁은 사용할 수 없습니다!
th: ขออภัย! ทิปที่ถูกระงับนี้ไม่สามารถใช้งานได้!
zh: 抱歉！此悬浮文案不可用！

source: Skin
ja: スキン
ko: 피부
th: ผิวหนัง
zh: 皮肤

source: timbre
ja: 音色
ko: 음색
th: ทิมเบอร์
zh: 音色

# bgmVolume
source: Background music volume
ja: BGM の音量
ko: 배경 음악 볼륨
th: ระดับเสียงเพลงพื้นหลัง
zh: 背景音乐音量

# tapInterval
source: Tap interval ({count}) seconds
ja: タップ間隔 ({count}) 秒
ko: 탭 간격({count})초
th: ช่วงเวลาการแตะ ({นับ}) วินาที
zh: 敲击间隔( {count} )秒

# tapGeedback
source: Tap Feedback
ja: タップフィードバック
ko: 탭 피드백
th: แตะความคิดเห็น
zh: 敲击反馈

# meritsAndVirtues
source: Merits
ja: メリット
ko: 장점
th: ข้อดี
zh: 功德

source: Early Birth Son
ja: 早生まれの息子
ko: 조기 출생 아들
th: ลูกชายที่เกิดก่อนกำหนด
zh: 早生贵子

source: The MoneyIsRolling
ko: 돈이 굴러가고 있습니다
th: เดอะมันนี่อิสโรลลิ่ง
zh: 财源滚滚

# everyPass
source: Every exam must be passed
ja: すべての試験に合格する必要があります
ko: 모든 시험을 통과해야 합니다
th: การสอบทุกครั้งต้องผ่าน
zh: 逢考必过

source: Agree
ja: 同意する
ko: 동의
th: เห็นด้วย
zh: 同意

source: Confirm
zh: 确认

source: Cancel
ja: キャンセル
ko: 취소
th: ยกเลิก
zh: 取消

source: version
ja: バージョン
ko: 버전
th: เวอร์ชัน
zh: 版本

source: Give praise
ja: 褒める
ko: 칭찬하다
th: สรรเสริญ
zh: 给好评

# startShop
source: Ready to start purchasing
ja: 購入プロセスを開始する準備ができました
ko: 구매 프로세스를 시작할 준비가 되었습니다.
th: พร้อมเริ่มกระบวนการจัดซื้อ
zh: 准备开始启动购买流程

# startShopFail
source: Purchase failed
ja: 購入に失敗しました
ko: 구매 실패
th: การซื้อล้มเหลว
zh: 购买失败了

# siknNames
source: Purple Sandalwood Fish, Golden Rosewood Wood Fish, White Wood Fish, Light Wood Fish, Blue Wood Fish, Pink Wood Fish, Christmas Wood Fish, Lion Head Wood Fish
ja: 紫の白檀の魚,ゴールデンローズウッドの魚,白い木の魚,バルサ木魚,青い木の魚,ピンクの木の魚,クリスマスの木の魚,ドラゴンヘッドウッドフィッシュ
ko: 보라색 백단향 물고기, 황금 자단 나무 물고기, 흰색 나무 물고기, 밝은 나무 물고기, 푸른 나무 물고기, 분홍 나무 물고기, 크리스마스 나무 물고기, 사자 머리 나무 물고기
th: ปลาไม้จันทน์สีม่วง, ปลาไม้พะยูงทอง, ปลาไม้ขาว, ปลาไม้สีอ่อน, ปลาไม้น้ำเงิน, ปลาไม้ชมพู, ปลาไม้คริสต์มาส, ปลาไม้หัวสิงโต
zh: 紫香檀木鱼,金色紫檀香木鱼,白色木鱼,轻木鱼,蓝色木鱼,粉色木鱼,圣诞木鱼,狮子头木鱼

# userAgreementTip
source: "Muyu - chanting artifact" is mainly used to calm inner emotions and prevent impulsiveness. When we provide services to you, we may need to collect and use your account-related information and call account services, store, and read mobile phone status and identity , and a little network information and network service authority, we promise that your personal information will only be used for the purpose we stated. Clicking "Agree" means that you agree to the above content.
ja: 「夢有詠唱アーティファクト」は主に内なる感情を落ち着かせ、衝動性を防ぐために使用されます。当社がお客様にサービスを提供する際、お客様のアカウント関連情報を収集して使用し、アカウント サービスの呼び出し、保存、読み取りが必要になる場合があります。携帯電話のステータスと身元情報、およびわずかなネットワーク情報とネットワーク サービス権限を含む、お客様の個人情報は、当社が明示した目的にのみ使用されることをお約束します。「同意する」をクリックすると、上記の内容に同意したものとみなされます。
ko: ”무유 챈팅 아티팩트”는 주로 내면의 감정을 진정시키고 충동성을 예방하는 데 사용됩니다. 저희가 귀하에게 서비스를 제공할 때 귀하의 계정 관련 정보를 수집 및 이용하고 계정 서비스를 호출하고, 저장하고, 열람해야 할 수 있습니다. 휴대전화 상태 및 신원, 약간의 네트워크 정보 및 네트워크 서비스 권한을 부여하여 귀하의 개인정보를 당사가 명시한 목적으로만 사용할 것을 약속드리며, ”, 동의 를 클릭하시면 위 내용에 동의함을 의미합니다.
th: "Muyu-chanting artifact" ส่วนใหญ่จะใช้เพื่อสงบอารมณ์ภายในและป้องกันความหุนหันพลันแล่น เมื่อเราให้บริการแก่คุณ เราอาจจำเป็นต้องรวบรวมและใช้ข้อมูลเกี่ยวกับบัญชีของคุณและเรียกใช้บริการบัญชี จัดเก็บ และอ่าน สถานะและตัวตนของโทรศัพท์มือถือ และข้อมูลเครือข่ายเล็กน้อยและหน่วยงานบริการเครือข่าย เราสัญญาว่าข้อมูลส่วนบุคคลของคุณจะถูกนำมาใช้เพื่อวัตถุประสงค์ที่เราระบุไว้เท่านั้น การคลิก "ยอมรับ" หมายความว่าคุณยอมรับเนื้อหาข้างต้น
zh: “木鱼 - 念经神器”主要用于平静内心情绪，防止冲动,我们在向您提供服务时，可能需要收集使用您账号相关信息及调用账号服务,存储,读取手机状态和身份,和一点网络信息及网络服务权限，我们承诺您的个人信息仅用于我们声明的目的。点击“同意”即表示您同意上述内容。

# introductionInfo
source: In Buddhist practice, wooden fish is a commonly used traditional aid to help practitioners focus and maintain rhythm. Although wooden fish is not a real fish, but according to different materials, shapes and uses, it can be There are several types: Solid Wooden Fish: Solid Wooden Fish: Carved from a single piece of solid wood, usually spherical or oval in shape. They are finely crafted and have a mellow sound. Hollow Wooden Fish: Hollow The wooden fish consists of two hemispherical wooden shells with a hollow interior. This design makes the sound more crisp and loud, suitable for use in large temples or open places. Hand-held wooden fish: The hand-held wooden fish is a small and convenient The wooden fish carried is usually composed of one or two small wooden blocks. Practitioners can hold and tap them to produce sound. Big wooden fish: Large wooden fish are generally used in temple halls or important ceremonies. Excellent and loud. Small wooden fish: Small wooden fish are small in size and are often used in personal practice or small-scale temples. It should be noted that these types are just some common types of wooden fish, and may vary due to It varies by region, tradition and personal preference. Regardless of the type of wooden fish used, its purpose is to help the practitioner achieve a state of focus and calm during meditation and chanting.
ja: 仏教の実践において、木魚は修行者が集中し、リズムを維持するのを助けるために一般的に使用される伝統的な補助具です。木魚は本物の魚ではありませんが、さまざまな素材、形状、用途に応じて、いくつかの魚が存在します。タイプ: 無垢の木製の魚: 無垢の木製の魚: 一枚の無垢材から彫られ、通常は球形または楕円形です。精巧に作られており、穏やかな音がします。 中空の木製の魚: 中空の木製の魚内部が空洞の 2 つの半球状の木製の殻で構成されています。このデザインにより、音がより鮮明で大きくなり、大きな寺院や開けた場所での使用に適しています。 手持ちの木魚: 手持ちの木魚は小さく、便利です。運ばれる木魚は、通常、1 つまたは 2 つの小さな木のブロックで構成されています。修行者は、これを持って叩いて音を出します。 大きな木魚: 大きな木魚は、通常、寺院のホールや重要な儀式で使用されます。優れた音量です。 小さな木魚: 小さな木魚はサイズが小さく、個人の練習や小規模な寺院でよく使用されます。 これらの種類は木魚の一般的な種類の一部にすぎず、状況により異なる場合があることに注意してください。それは地域、伝統、個人の好みによって異なります。使用される木魚の種類に関係なく、その目的は、修行者が瞑想や詠唱中に集中力と落ち着きの状態を達成できるようにすることです。」
ko: 목어는 불교 수련에서 수행자가 집중하고 리듬을 유지하도록 돕기 위해 일반적으로 사용되는 전통 보조 도구입니다. 목어는 실제 물고기는 아니지만 재료, 모양 및 용도에 따라 다를 수 있습니다. 여러 유형: 단단한 나무 물고기: 단단한 나무 물고기: 일반적으로 구형 또는 타원형 모양의 단단한 나무 한 조각으로 조각됩니다. 정교하게 제작되었으며 부드러운 소리가 납니다. 속이 빈 나무 물고기: 속이 빈 나무 물고기는 내부가 비어 있는 두 개의 반구형 나무 껍질로 구성됩니다. 이 디자인은 소리를 더 선명하고 크게 만들어 큰 사원이나 탁 트인 장소에서 사용하기에 적합합니다. 운반되는 목어는 일반적으로 하나 또는 두 개의 작은 나무 블록으로 구성됩니다. 수행자는 이를 잡고 두드려 소리를 낼 수 있습니다. 큰 목어: 큰 목어는 일반적으로 절이나 중요한 의식에서 사용됩니다. 훌륭하고 시끄럽습니다. . 작은 목어: 작은 목어는 크기가 작으며 개인 연습이나 소규모 사원에서 자주 사용됩니다. 이러한 유형은 목어의 일반적인 유형일 뿐이며 다를 수 있습니다. 지역, 전통 및 개인 취향에 따라 다릅니다. 사용되는 목어의 종류에 관계없이 그 목적은 수행자가 명상과 구호 중에 집중하고 차분한 상태를 달성하도록 돕는 것입니다.
th: ในการปฏิบัติทางพุทธศาสนา ปลาไม้เป็นเครื่องมือเสริมแบบดั้งเดิมที่ใช้กันทั่วไปเพื่อช่วยให้ผู้ฝึกมีสมาธิและรักษาจังหวะ แม้ว่าปลาไม้จะไม่ใช่ปลาจริง แต่ตามวัสดุ รูปร่าง และการใช้งานที่แตกต่างกัน มันสามารถมีได้ หลายประเภท: ปลาไม้ตัน: ปลาไม้ตัน: แกะสลักจากไม้เนื้อแข็งชิ้นเดียว มักจะเป็นรูปทรงกลมหรือวงรี พวกมันถูกสร้างขึ้นอย่างประณีตและมีเสียงที่ไพเราะ ปลาไม้กลวง: กลวงที่ทำจากไม้ ปลาประกอบด้วยเปลือกไม้สองซีกที่มีภายในกลวง การออกแบบนี้ทำให้เสียงคมชัดและดังยิ่งขึ้น เหมาะสำหรับใช้ในวัดขนาดใหญ่หรือสถานที่เปิดโล่ง ปลาไม้มือถือ: ปลาไม้มือถือมีขนาดเล็ก และสะดวก ปลาไม้ที่บรรทุกมักจะประกอบด้วยบล็อกไม้เล็กๆ 1-2 ก้อน ผู้ปฏิบัติสามารถถือและเคาะให้เกิดเสียงได้ ปลาไม้ใหญ่: ปลาไม้ขนาดใหญ่มักใช้ในศาลาวัดหรืองานพิธีสำคัญๆ ยอดเยี่ยม และเสียงดัง . ปลาไม้เล็ก: ปลาไม้เล็กมีขนาดเล็กและมักใช้ในการปฏิบัติส่วนตัวหรือวัดขนาดเล็ก ควรสังเกตว่าปลาเหล่านี้เป็นเพียงปลาไม้บางประเภททั่วไป และอาจแตกต่างกันไป เนื่องจากมันแตกต่างกันไปตามภูมิภาค ประเพณี และความชอบส่วนบุคคล ไม่ว่าจะใช้ ปลาไม้ ชนิดใด จุดประสงค์คือเพื่อช่วยให้ผู้ปฏิบัติบรรลุสภาวะของสมาธิและความสงบในระหว่างการทำสมาธิและสวดมนต์
zh: 在佛教修行中，木鱼是一种常用的传统辅助工具，用于帮助修行者专注和保持节奏。虽然木鱼并非真正的鱼类，但根据不同的制作材料、形状和用途，可以分为以下几种类型： 实心木鱼：实心木鱼是由整块实木雕刻而成的，通常呈圆球或椭圆形。它们制作精细，声音圆润悦耳。 空心木鱼：空心木鱼由两个半球形木制壳体组成，内部为空心。这种设计使得声音更加清脆响亮，适合在大庙宇或开放场所使用。 手持木鱼：手持木鱼是一种较小且方便携带的木鱼，通常由一个或两个小木块构成。修行者可以手持并敲击它们来产生声音。 大木鱼：大木鱼一般用于寺庙大殿或重要仪式中，尺寸较大，制作精良，音量较大。 小木鱼：小木鱼尺寸较小，常用于个人修行或小规模的寺庙。 需要注意的是，这些种类只是一些常见的木鱼类型，并且可能因地区、传统和个人偏好而有所不同。无论使用何种类型的木鱼，其目的都是帮助修行者在冥想和念诵中达到专注和平静的状态。

# aboutInfo
source: Wooden Fish-chanting artifact is a practice app that simulates the real wooden fish knocking to help users calm down and decompress. Wooden fish is a magical instrument, which is mostly used for homework and pujas in Buddhism and Taoism. It is said that fish do not match eyes day and night, Therefore, the wood is carved in the shape of a fish, which is used to warn monks to think day and night. There are two shapes: one is a straight fish shape, which is used for porridge and rice, or gathers people and police, and is hung on the corridor of the temple. The other is round. Fish-shaped, used when chanting scriptures, placed on the table. Since Ming and Qing Dynasties, wooden fish has been commonly used in folk music, Teochew opera, and Cantonese opera. The wooden fish has the function of musical instruments in addition to ritual utensils Origin of wooden fish: Master Xuanzang, an eminent monk in the Tang Dynasty When returning from learning scriptures from the Western Regions, passing through the land of Shu, I met an elder and went to his home to have a vegetarian meal. The son of the elder was framed by his stepmother and thrown into the river, where he was swallowed by a big fish. It just so happened that Master Xuanzang wanted to eat fish that day. The victim had no choice but to go out and buy a big fish. While dissecting the fish, he rescued his child from the belly of the fish. Master Xuanzang said: "This is the karma of this child's long-cherished wish to uphold the Buddhist precept of not killing, so although Be swallowed by fish, but not die. The elder said: "Then how can we repay the fish's kindness?" Marshal Xuanzang told him: "The fish sacrificed to save the child should be carved into a fish shape with wood, hung in the Buddhist temple, and knocked every time during the fasting meal, so as to repay the virtue of the big fish."
ja: 木魚の詠唱アーティファクトは、実際の木魚のノックをシミュレートして、ユーザーを落ち着かせて緊張を解くのに役立つ練習アプリです。木魚は魔法の道具であり、主に仏教と道教の宿題や法会に使用されます。魚は昼も夜も目が合わないと言われているため、僧侶に昼も夜も考えるよう警告するために木に魚の形を彫ったもので、まっすぐな魚の形と、まっすぐな魚の形の2種類があります。 1つは粥や米を入れたり、人や警察を集めたり、寺院の廊下に吊るしたり、もう1つは円形で、経典を唱えるときにテーブルの上に置いたりする魚の形をしたもので、明清の時代から木魚が作られました。民俗音楽、潮州オペラ、広東オペラでよく使われてきました。木魚には祭具だけでなく楽器の役割もあります 木魚の起源: 唐時代の高名な僧侶玄奘三蔵法師が経典の学習から帰ったとき西域から蜀の地を通って、ある長老に会い、精進料理を食べに彼の家に行ったところ、長老の息子は継母に嵌められて川に投げ込まれ、大物に飲み込まれました。 「その日、玄奘先生はたまたま魚が食べたかったのです。被害者は仕方なく大きな魚を買いに行きました。魚を解剖しているときに、魚の腹から子供を救い出しました。玄奘先生は言いました」 「これは不殺生の戒律を守りたいというこの子の悲願の業だから、魚に呑まれても死なない。」 長老は「それではどうやって魚に恩返しをすればいいでしょうか？」と言いました。 玄奘元帥は彼に、「子供を救うために犠牲になった魚を木で魚の形に彫り、仏教寺院に吊るし、断食のたびに大魚の徳に報いるためにたたきなさい」と言いました。 」
ko: 나무 물고기 노래 유물 는 실제 나무 물고기 노크를 시뮬레이션하여 사용자가 긴장을 풀 수 있도록 도와주는 연습용 앱입니다. 나무 물고기는 주로 불교와 도교에서 숙제와 푸자에 사용되는 마법의 도구라고 합니다. 물고기는 밤낮으로 눈이 맞지 않기 때문에 나무를 물고기 모양으로 조각하여 승려에게 밤낮으로 생각하게 하라고 경고하였다. 죽과 밥으로 쓰거나 사람과 경찰을 모으며 사찰 회랑에 걸고 다른 하나는 둥글게 물고기 모양으로 경전을 외울 때 사용하며 탁자 위에 놓는다 명청시대 이후 목어는 민요, 터추오페라, 광동오페라에서 흔히 사용되는 목어는 의식용 도구 외에 악기의 기능도 겸비 목어의 유래: 당나라의 명승 현장장사 경전을 배우고 돌아올 때 내가 서방에서 촉나라로 지나다가 한 장로를 만나 그의 집에 금식하러 가는데 그 장로의 아들이 계모의 모함을 받아 강에 던져져 큰 물고기에게 삼켜지는지라 현장 스승은 그날 생선을 먹고 싶었습니다. 피해자는 어쩔 수 없이 나가서 큰 물고기를 사야 했습니다. 물고기를 해부하다가 물고기 뱃속에서 아이를 구했습니다. 현장 스승이 말했습니다. 불살생의 계율을 지켜 물고기에게 삼켜져도 죽지 않기를 바라는 이 아이의 염원. 장로가 말했다: ”그럼 우리가 물고기의 은혜를 어떻게 갚을 수 있겠습니까?”, 삼장법사는 그에게 ”,아이를 구하기 위해 바친 물고기는 나무로 물고기 모양으로 깎아 절에 걸고 단식 때마다 두드려 큰 물고기의 덕을 보답해야 한다”,고 말했다.
th: สิ่งประดิษฐ์การสวดมนต์ของปลาไม้เป็นแอพฝึกฝนที่จำลองการเคาะปลาไม้จริงเพื่อช่วยให้ผู้ใช้คลายความเครียด ปลาไม้เป็นเครื่องมือวิเศษ ซึ่งส่วนใหญ่ใช้สำหรับการบ้านและบูชาในศาสนาพุทธและเต๋า ว่ากันว่า ว่าปลาไม่เข้าตาทั้งกลางวันและกลางคืนจึงแกะไม้เป็นรูปปลาใช้เตือนพระให้คิดทั้งกลางวันและกลางคืน มี ๒ รูป คือ รูปปลาตั้งตรง ใช้สำหรับใส่ข้าวต้มหรือเรียกรวมพลและตำรวจแขวนไว้ตามทางเดินของวัด ส่วนอีกอัน เป็นทรงกลม รูปปลา ใช้ตอนสวดพระไตรปิฎก วางบนโต๊ะ ตั้งแต่สมัยราชวงศ์หมิงและชิง ปลาไม้ นิยมใช้ในดนตรีพื้นเมือง อุปรากรแต้จิ๋ว และงิ้วกวางตุ้ง ปลาไม้มีหน้าที่เป็นเครื่องดนตรีนอกเหนือจากเครื่องใช้ในพิธีกรรม ที่มาของปลาไม้: ปรมาจารย์ Xuanzang พระเกจิอาจารย์ในสมัยราชวงศ์ถัง เมื่อกลับจากเรียนคัมภีร์ จากภูมิภาคตะวันตกผ่านดินแดนแห่ง Shu ฉันพบผู้อาวุโสคนหนึ่งและไปที่บ้านของเขาเพื่ออดอาหาร ลูกชายของผู้อาวุโสถูกแม่เลี้ยงล้อมกรอบ โยนลงแม่น้ำและปลาตัวใหญ่กลืน มันเกิดขึ้นที่ วันนั้นอาจารย์ Xuanzang ต้องการกินปลา เหยื่อไม่มีทางเลือกนอกจากต้องออกไปซื้อปลาตัวใหญ่ ในขณะที่ชำแหละปลา เขาช่วยลูกของเขาออกจากท้องปลา อาจารย์ Xuanzang กล่าวว่า: "นี่คือกรรมของ ความปรารถนาอันแรงกล้าของเด็กคนนี้จะรักษาศีลของชาวพุทธว่า ไม่ฆ่า ต่อให้ถูกปลากลืนก็ไม่ตาย ผู้อาวุโสกล่าวว่า "แล้วเราจะตอบแทนน้ำใจของปลาได้อย่างไร" จอมพล Xuanzang บอกเขาว่า: "ปลาที่เสียสละเพื่อช่วยเด็กควรแกะสลักเป็นรูปปลาด้วยไม้แขวนไว้ในวัดและเคาะทุกครั้งระหว่างการอดอาหารเพื่อตอบแทนคุณงามความดีของปลาใหญ่"
zh: 木鱼 - 念经神器是一款修炼App，模拟真实木鱼敲击，帮用户静心解压。木鱼是一种法器，多用于佛教、道教的功课与法会。相传鱼昼夜不合目，故刻木像鱼形，击之以警戒僧众应昼夜思道。形制有二：一为挺直鱼形，用来粥饭或集众、警众，悬挂在寺院走廊上。二为圆状鱼形，诵经时所用，放在案上。明、清以来，民间音乐和潮剧、粤剧中常用到木鱼。使木鱼除法器外兼具乐器功能\n木鱼由来:唐代高僧玄奘大师从西域取经归来时，途经蜀地，遇一长者，到其家化斋。长者之子被后母陷害，扔进了河里，被一条大鱼吞食。恰好那天玄奘大师偏要吃鱼，长者只好出去买回了一条大鱼。在剖鱼的时候，从鱼腹中救出了自己的孩儿。玄奘大师说：“这正是此儿夙愿把持佛律中不杀戒的因果报应，所以虽被鱼吞，却得不死。”长者说：“那怎么样才能报答鱼恩呢。”玄奘大帅告诉说：“鱼为救孩而牺牲，应该用木雕成鱼形，悬于佛寺之中，每逢斋饭时敲击，以此可报大鱼之德。

source: Restore
ja: 復元
ko: 복원
th: การกู้คืน
zh: 恢复购买
